In [2]:
# PANDAS DROP ENTRY
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from random import randint,random,randrange

In [35]:
series = Series(np.arange(6),index = ['a','b','c','d','e','f'])
series

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [36]:
# Selecting Entries
series = 2 * series
series

a     0
b     2
c     4
d     6
e     8
f    10
dtype: int64

In [37]:
#IF YOU WANT TO DROP AN INDEX
series = series.drop(labels = ['f'])
series

a    0
b    2
c    4
d    6
e    8
dtype: int64

In [40]:
series[2]

4

In [42]:
series['b']

0

In [51]:
series[:3]

a    0
b    2
c    4
dtype: int64

In [52]:
series[series>5]

d    6
e    8
dtype: int64

In [53]:
# to set the values
series[series>5] = 10
series

a     0
b     2
c     4
d    10
e    10
dtype: int64

In [54]:
# how drop works in data frame
dataframe = DataFrame(np.arange(25).reshape(5,5),index = ['SA','LA','NYC','NJ','DC'],columns = ['Population','Size','year','Wheather','GDP'])
dataframe

     Population  Size  year  Wheather  GDP
SA            0     1     2         3    4
LA            5     6     7         8    9
NYC          10    11    12        13   14
NJ           15    16    17        18   19
DC           20    21    22        23   24

In [55]:
#If we want to drop a row
dataframe = dataframe.drop(index = ['NJ'],columns =['GDP'])
dataframe

     Population  Size  year  Wheather
SA            0     1     2         3
LA            5     6     7         8
NYC          10    11    12        13
DC           20    21    22        23

In [56]:
#boolean expressions
dataframe >10

     Population   Size   year  Wheather
SA        False  False  False     False
LA        False  False  False     False
NYC       False   True   True      True
DC         True   True   True      True